In [46]:
import pandas as pd
import numpy as np
from math import floor
import itertools

In [47]:
# User specific variables
file_name = "Student List"
remove_cols = ['T1 (20)', 'T2 ()', 'T3 ()'] # columns that need to be dropped, leave list empty if not required
questions_count_total = 9 # total number of questions to choose from
questions_count = 5 # number to questions students will answer

In [48]:
df = pd.read_csv(file_name+".csv")
student_count_total = df.shape[0] # total number of students
df.head()

              ID                         Name  T1 (20)  T2 ()  T3 ()
0  2015100000073       Hossain Mohammad Jabir     14.0    NaN    NaN
1  2015100000077                   Pias Ghosh      6.0    NaN    NaN
2  2015100000139          Md.Shahrukh Hossain     14.0    NaN    NaN
3  2015100000142  Most. Sumaiya Aktar Shemkey      7.0    NaN    NaN
4  2016000000247                Ishika Farhad      7.0    NaN    NaN

In [49]:
df.dtypes

ID           int64
Name        object
T1 (20)    float64
T2 ()      float64
T3 ()      float64
dtype: object

In [50]:
# Drop unwanted columns
df = df.drop(remove_cols, axis=1)

In [51]:
# Shuffle rows
df = df.sample(frac=1)
df.head()

               ID                Name
17  2018000000031  Tajrin Ahmad Nahin
4   2016000000247       Ishika Farhad
8   2017000000097    Md. Istiaq Ahmed
14  2017100000150            Rabbinur
21  2018000000046      Swarnali Akter

In [52]:
# Create list containing question numbers
questions = []
for i in range(1,questions_count_total+1):
    questions.append(i)

# Generating combinations
combinations_total = []

for subset in itertools.combinations(questions, questions_count):
        combinations_total.append(subset)
        
combinations_count = len(combinations_total)
# Making new list containing required number of combinations from all possible combinations
combinations_required = []
for i in range(0,combinations_count,floor(combinations_count/student_count_total)):
    combinations_required.append(combinations_total[i])

In [57]:
# Create new column
col_name = "Questions"
df[col_name] = ""

# Add question numbers to dataframe
for index, row in df.iterrows():
    df.at[index, col_name] = combinations_required[index]

In [58]:
df.head()

               ID                Name        Questions
17  2018000000031  Tajrin Ahmad Nahin  (1, 5, 7, 8, 9)
4   2016000000247       Ishika Farhad  (1, 2, 4, 5, 7)
8   2017000000097    Md. Istiaq Ahmed  (1, 2, 6, 7, 9)
14  2017100000150            Rabbinur  (1, 4, 5, 6, 8)
21  2018000000046      Swarnali Akter  (2, 3, 5, 7, 9)

In [59]:
# Sort rows by ID
df = df.sort_values(by=['ID'])
df.head()

              ID                         Name        Questions
0  2015100000073       Hossain Mohammad Jabir  (1, 2, 3, 4, 5)
1  2015100000077                   Pias Ghosh  (1, 2, 3, 4, 9)
2  2015100000139          Md.Shahrukh Hossain  (1, 2, 3, 5, 9)
3  2015100000142  Most. Sumaiya Aktar Shemkey  (1, 2, 3, 7, 8)
4  2016000000247                Ishika Farhad  (1, 2, 4, 5, 7)

In [60]:
df.to_csv(file_name+" Question Numbers.csv", index=False)